Repository: ElectroAttacks/UtilityKit.MessageTemplateCache
Catalog: MessageTemplateCache.Analyzers/Ressources/Strings.*.resx
Languages: fr, it

# InvalidParameters_CodeFix
source: Fix incorrect value
fr: Correction d'une valeur incorrecte
it: Correggere il valore errato

# InvalidParameters_Description
source: The parameters provided in 'CreateRequest()' do not match the expected metadata values (CallerMemberName, CallerFilePath, and CallerLineNumber). This warning is raised when the parameters are deliberately set to obtain the template of another method. However, it might lead to unexpected behavior in the message template handling. Ensure that the provided parameters match the metadata automatically set by the compiler when not intentionally retrieving another method's template.
fr: Les paramètres fournis dans 'CreateRequest()' ne correspondent pas aux valeurs de métadonnées attendues (CallerMemberName, CallerFilePath et CallerLineNumber). Cet avertissement est levé lorsque les paramètres sont délibérément définis pour obtenir le modèle d'une autre méthode. Cependant, cela peut entraîner un comportement inattendu dans la gestion du modèle de message. Assurez-vous que les paramètres fournis correspondent aux métadonnées définies automatiquement par le compilateur lorsqu'il ne récupère pas intentionnellement le modèle d'une autre méthode.
it: I parametri forniti in 'CreateRequest()' non corrispondono ai valori dei metadati previsti (CallerMemberName, CallerFilePath e CallerLineNumber). Questo avviso viene generato quando i parametri vengono deliberatamente impostati per ottenere il modello di un altro metodo. Tuttavia, potrebbe causare un comportamento imprevisto nella gestione del modello di messaggio. Assicurarsi che i parametri forniti corrispondano ai metadati impostati automaticamente dal compilatore quando non si recupera intenzionalmente il modello di un altro metodo.

# InvalidParameters_MessageFormat
source: Incorrect parameters provided in 'CreateRequest()'. Parameter '{0}' has a value of '{1}' but an expected value of '{2}'
fr: Paramètres incorrects fournis dans 'CreateRequest()'. Le paramètre '{0}' a une valeur de '{1}' mais une valeur attendue de '{2}'
it: Parametri non corretti forniti in 'CreateRequest()'. Il parametro '{0}' ha un valore di '{1}' ma un valore previsto di '{2}'

# InvalidParameters_Title
source: Incorrect values might be passed to 'CreateRequest()'
fr: Des valeurs incorrectes peuvent être transmises à 'CreateRequest()'
it: Potrebbero essere passati valori errati a 'CreateRequest()'

# NoExplicitParameters_CodeFix
source: Remove explicit parameters
fr: Supprimer les paramètres explicites
it: Rimuove i parametri espliciti

# NoExplicitParameters_Description
source: Passing explicit parameters might result in unexpected behavior. To ensure that the correct message template is returned, you should call the method with no arguments.
fr: La transmission de paramètres explicites peut entraîner un comportement inattendu. Pour vous assurer que le modèle de message correct est renvoyé, vous devez appeler la méthode sans arguments.
it: Il passaggio di parametri espliciti potrebbe causare un comportamento imprevisto. Per garantire che venga restituito il modello di messaggio corretto, è necessario chiamare il metodo senza argomenti.

# NoExplicitParameters_MessageFormat
source: 'CreateRequest()' should be called without explicit parameters
fr: 'CreateRequest()' doit être appelé sans paramètres explicites
it: 'CreateRequest()' deve essere chiamato senza parametri espliciti

# NoExplicitParameters_Title
source: 'CreateRequest()' should be called without explicit parameters
fr: 'CreateRequest()' doit être appelé sans paramètres explicites
it: 'CreateRequest()' deve essere chiamato senza parametri espliciti

# UniqueIdentifiers_CodeFix
source: Add unique identifier
fr: Ajouter un identifiant unique
it: Aggiungi identificatore univoco

# UniqueIdentifiers_Description
source: Using multiple message templates in the same method requires unique identifiers. To ensure that the correct template is returned, you must use a unique identifier and also pass it in the request through the 'WithIdentifier()' method.
fr: L'utilisation de plusieurs modèles de message dans la même méthode nécessite des identifiants uniques. Pour vous assurer que le modèle correct est renvoyé, vous devez utiliser un identifiant unique et également le transmettre dans la requête via la méthode 'WithIdentifier()'.
it: L'utilizzo di più modelli di messaggio nello stesso metodo richiede identificatori univoci. Per garantire che venga restituito il modello corretto, è necessario utilizzare un identificatore univoco e passarlo anche nella richiesta tramite il metodo 'WithIdentifier()'.

# UniqueIdentifiers_MessageFormat
source: The method '{0}' has multiple message templates without unique identifiers. Ensure that each template has a unique identifier to avoid ambiguous results.
fr: La méthode '{0}' a plusieurs modèles de message sans identifiants uniques. Assurez-vous que chaque modèle possède un identifiant unique pour éviter des résultats ambigus.
it: Il metodo '{0}' ha più modelli di messaggio senza identificatori univoci. Assicurati che ogni modello abbia un identificatore univoco per evitare risultati ambigui.

# UniqueIdentifiers_Title
source: Use unique identifiers when using multiple message templates
fr: Utiliser des identifiants uniques lors de l'utilisation de plusieurs modèles de message
it: Utilizzare identificatori univoci quando si utilizzano più modelli di messaggio
